<?php
namespace common\components;

class SeoUrlHelper
{
	
//public static $ArStopWords='["،","آض","آمينَ","آه","آهاً","آي","أ","أب","أجل","أجمع","أخ","أخذ","أصبح","أضحى","أقبل","أقل","أكثر","ألا","أم","أما","أمامك","أمامكَ","أمسى","أمّا","أن","أنا","أنت","أنتم","أنتما","أنتن","أنتِ","أنشأ","أنّى","أو","أوشك","أولئك","أولئكم","أولاء","أولالك","أوّهْ","أي","أيا","أين","أينما","أيّ","أَنَّ","أََيُّ","أُفٍّ","إذ","إذا","إذاً","إذما","إذن","إلى","إليكم","إليكما","إليكنّ","إليكَ","إلَيْكَ","إلّا","إمّا","إن","إنّما","إي","إياك","إياكم","إياكما","إياكن","إيانا","إياه","إياها","إياهم","إياهما","إياهن","إياي","إيهٍ","إِنَّ","ا","ابتدأ","اثر","اجل","احد","اخرى","اخلولق","اذا","اربعة","ارتدّ","استحال","اطار","اعادة","اعلنت","اف","اكثر","اكد","الألاء","الألى","الا","الاخيرة","الان","الاول","الاولى","التى","التي","الثاني","الثانية","الذاتي","الذى","الذي","الذين","السابق","الف","اللائي","اللاتي","اللتان","اللتيا","اللتين","اللذان","اللذين","اللواتي","الماضي","المقبل","الوقت","الى","اليوم","اما","امام","امس","ان","انبرى","انقلب","انه","انها","او","اول","اي","ايار","ايام","ايضا","ب","بات","باسم","بان","بخٍ","برس","بسبب","بسّ","بشكل","بضع","بطآن","بعد","بعض","بك","بكم","بكما","بكن","بل","بلى","بما","بماذا","بمن","بن","بنا","به","بها","بي","بيد","بين","بَسْ","بَلْهَ","بِئْسَ","تانِ","تانِك","تبدّل","تجاه","تحوّل","تلقاء","تلك","تلكم","تلكما","تم","تينك","تَيْنِ","تِه","تِي","ثلاثة","ثم","ثمّ","ثمّة","ثُمَّ","جعل","جلل","جميع","جير","حار","حاشا","حاليا","حاي","حتى","حرى","حسب","حم","حوالى","حول","حيث","حيثما","حين","حيَّ","حَبَّذَا","حَتَّى","حَذارِ","خلا","خلال","دون","دونك","ذا","ذات","ذاك","ذانك","ذانِ","ذلك","ذلكم","ذلكما","ذلكن","ذو","ذوا","ذواتا","ذواتي","ذيت","ذينك","ذَيْنِ","ذِه","ذِي","راح","رجع","رويدك","ريث","رُبَّ","زيارة","سبحان","سرعان","سنة","سنوات","سوف","سوى","سَاءَ","سَاءَمَا","شبه","شخصا","شرع","شَتَّانَ","صار","صباح","صفر","صهٍ","صهْ","ضد","ضمن","طاق","طالما","طفق","طَق","ظلّ","عاد","عام","عاما","عامة","عدا","عدة","عدد","عدم","عسى","عشر","عشرة","علق","على","عليك","عليه","عليها","علًّ","عن","عند","عندما","عوض","عين","عَدَسْ","عَمَّا","غدا","غير","ـ","ف","فان","فلان","فو","فى","في","فيم","فيما","فيه","فيها","قال","قام","قبل","قد","قطّ","قلما","قوة","كأنّما","كأين","كأيّ","كأيّن","كاد","كان","كانت","كذا","كذلك","كرب","كل","كلا","كلاهما","كلتا","كلم","كليكما","كليهما","كلّما","كلَّا","كم","كما","كي","كيت","كيف","كيفما","كَأَنَّ","كِخ","لئن","لا","لات","لاسيما","لدن","لدى","لعمر","لقاء","لك","لكم","لكما","لكن","لكنَّما","لكي","لكيلا","للامم","لم","لما","لمّا","لن","لنا","له","لها","لو","لوكالة","لولا","لوما","لي","لَسْتَ","لَسْتُ","لَسْتُم","لَسْتُمَا","لَسْتُنَّ","لَسْتِ","لَسْنَ","لَعَلَّ","لَكِنَّ","لَيْتَ","لَيْسَ","لَيْسَا","لَيْسَتَا","لَيْسَتْ","لَيْسُوا","لَِسْنَا","ما","ماانفك","مابرح","مادام","ماذا","مازال","مافتئ","مايو","متى","مثل","مذ","مساء","مع","معاذ","مقابل","مكانكم","مكانكما","مكانكنّ","مكانَك","مليار","مليون","مما","ممن","من","منذ","منها","مه","مهما","مَنْ","مِن","نحن","نحو","نعم","نفس","نفسه","نهاية","نَخْ","نِعِمّا","نِعْمَ","ها","هاؤم","هاكَ","هاهنا","هبّ","هذا","هذه","هكذا","هل","هلمَّ","هلّا","هم","هما","هن","هنا","هناك","هنالك","هو","هي","هيا","هيت","هيّا","هَؤلاء","هَاتانِ","هَاتَيْنِ","هَاتِه","هَاتِي","هَجْ","هَذا","هَذانِ","هَذَيْنِ","هَذِه","هَذِي","هَيْهَاتَ","و","و6","وا","واحد","واضاف","واضافت","واكد","وان","واهاً","واوضح","وراءَك","وفي","وقال","وقالت","وقد","وقف","وكان","وكانت","ولا","ولم","ومن","وهو","وهي","ويكأنّ","وَيْ","وُشْكَانََ","يكون","يمكن","يوم","ّأيّان","الان","الآن","شاهد","عاجل","ورد","وهذا","حدث","هام"]';
//public $stopWords="، آض آمينَ آه آهاً آي أ أب أجل أجمع أخ أخذ أصبح أضحى أقبل أقل أكثر ألا أم أما أمامك أمامكَ أمسى أمّا أن أنا أنت أنتم أنتما أنتن أنتِ أنشأ أنّى أو أوشك أولئك أولئكم أولاء أولالك أوّهْ أي أيا أين أينما أيّ أَنَّ أََيُّ أُفٍّ إذ إذا إذاً إذما إذن إلى إليكم إليكما إليكنّ إليكَ إلَيْكَ إلّا إمّا إن إنّما إي إياك إياكم إياكما إياكن إيانا إياه إياها إياهم إياهما إياهن إياي إيهٍ إِنَّ ا ابتدأ اثر اجل احد اخرى اخلولق اذا اربعة ارتدّ استحال اطار اعادة اعلنت اف اكثر اكد الألاء الألى الا الاخيرة الان الاول الاولى التى التي الثاني الثانية الذاتي الذى الذي الذين السابق الف اللائي اللاتي اللتان اللتيا اللتين اللذان اللذين اللواتي الماضي المقبل الوقت الى اليوم اما امام امس ان انبرى انقلب انه انها او اول اي ايار ايام ايضا ب بات باسم بان بخٍ برس بسبب بسّ بشكل بضع بطآن بعد بعض بك بكم بكما بكن بل بلى بما بماذا بمن بن بنا به بها بي بيد بين بَسْ بَلْهَ بِئْسَ تانِ تانِك تبدّل تجاه تحوّل تلقاء تلك تلكم تلكما تم تينك تَيْنِ تِه تِي ثلاثة ثم ثمّ ثمّة ثُمَّ جعل جلل جميع جير حار حاشا حاليا حاي حتى حرى حسب حم حوالى حول حيث حيثما حين حيَّ حَبَّذَا حَتَّى حَذارِ خلا خلال دون دونك ذا ذات ذاك ذانك ذانِ ذلك ذلكم ذلكما ذلكن ذو ذوا ذواتا ذواتي ذيت ذينك ذَيْنِ ذِه ذِي راح رجع رويدك ريث رُبَّ زيارة سبحان سرعان سنة سنوات سوف سوى سَاءَ سَاءَمَا شبه شخصا شرع شَتَّانَ صار صباح صفر صهٍ صهْ ضد ضمن طاق طالما طفق طَق ظلّ عاد عام عاما عامة عدا عدة عدد عدم عسى عشر عشرة علق على عليك عليه عليها علًّ عن عند عندما عوض عين عَدَسْ عَمَّا غدا غير ـ ف فان فلان فو فى في فيم فيما فيه فيها قال قام قبل قد قطّ قلما قوة كأنّما كأين كأيّ كأيّن كاد كان كانت كذا كذلك كرب كل كلا كلاهما كلتا كلم كليكما كليهما كلّما كلَّا كم كما كي كيت كيف كيفما كَأَنَّ كِخ لئن لا لات لاسيما لدن لدى لعمر لقاء لك لكم لكما لكن لكنَّما لكي لكيلا للامم لم لما لمّا لن لنا له لها لو لوكالة لولا لوما لي لَسْتَ لَسْتُ لَسْتُم لَسْتُمَا لَسْتُنَّ لَسْتِ لَسْنَ لَعَلَّ لَكِنَّ لَيْتَ لَيْسَ لَيْسَا لَيْسَتَا لَيْسَتْ لَيْسُوا لَِسْنَا ما ماانفك مابرح مادام ماذا مازال مافتئ مايو متى مثل مذ مساء مع معاذ مقابل مكانكم مكانكما مكانكنّ مكانَك مليار مليون مما ممن من منذ منها مه مهما مَنْ مِن نحن نحو نعم نفس نفسه نهاية نَخْ نِعِمّا نِعْمَ ها هاؤم هاكَ هاهنا هبّ هذا هذه هكذا هل هلمَّ هلّا هم هما هن هنا هناك هنالك هو هي هيا هيت هيّا هَؤلاء هَاتانِ هَاتَيْنِ هَاتِه هَاتِي هَجْ هَذا هَذانِ هَذَيْنِ هَذِه هَذِي هَيْهَاتَ و و6 وا واحد واضاف واضافت واكد وان واهاً واوضح وراءَك وفي وقال وقالت وقد وقف وكان وكانت ولا ولم ومن وهو وهي ويكأنّ وَيْ وُشْكَانََ يكون يمكن يوم ّأيّان";


public static $StopWords="،;ء;ءَ;آ;آب;آذار;آض;آل;آمينَ;آناء;آنفا;آه;آهاً;آهٍ;آهِ;أ;أبدا;أبريل;أبو;أبٌ;أجل;أجمع;أحد;أخبر;أخذ;أخو;أخٌ;أربع;أربعاء;أربعة;أربعمئة;أربعمائة;أرى;أسكن;أصبح;أصلا;أضحى;أطعم;أعطى;أعلم;أغسطس;أفريل;أفعل به;أفٍّ;أقبل;أكتوبر;أل;ألا;ألف;ألفى;أم;أما;أمام;أمامك;أمامكَ;أمد;أمس;أمسى;أمّا;أن;أنا;أنبأ;أنت;أنتم;أنتما;أنتن;أنتِ;أنشأ;أنه;أنًّ;أنّى;أهلا;أو;أوت;أوشك;أول;أولئك;أولاء;أولالك;أوّهْ;أى;أي;أيا;أيار;أيضا;أيلول;أين;أيّ;أيّان;أُفٍّ;ؤ;إحدى;إذ;إذا;إذاً;إذما;إذن;إزاء;إلى;إلي;إليكم;إليكما;إليكنّ;إليكَ;إلَيْكَ;إلّا;إمّا;إن;إنَّ;إى;إياك;إياكم;إياكما;إياكن;إيانا;إياه;إياها;إياهم;إياهما;إياهن;إياي;إيهٍ;ئ;ا;ا?;ا?ى;االا;االتى;ابتدأ;ابين;اتخذ;اثر;اثنا;اثنان;اثني;اثنين;اجل;احد;اخرى;اخلولق;اذا;اربعة;اربعون;اربعين;ارتدّ;استحال;اصبح;اضحى;اطار;اعادة;اعلنت;اف;اكثر;اكد;الآن;الألاء;الألى;الا;الاخيرة;الان;الاول;الاولى;التى;التي;الثاني;الثانية;الحالي;الذاتي;الذى;الذي;الذين;السابق;الف;اللاتي;اللتان;اللتيا;اللتين;اللذان;اللذين;اللواتي;الماضي;المقبل;الوقت;الى;الي;اليه;اليها;اليوم;اما;امام;امس;امسى;ان;انبرى;انقلب;انه;انها;او;اول;اي;ايار;ايام;ايضا;ب;بؤسا;بإن;بئس;باء;بات;باسم;بان;بخٍ;بد;بدلا;برس;بسبب;بسّ;بشكل;بضع;بطآن;بعد;بعدا;بعض;بغتة;بل;بلى;بن;به;بها;بهذا;بيد;بين;بَسْ;بَلْهَ;ة;ت;تاء;تارة;تاسع;تانِ;تانِك;تبدّل;تجاه;تحت;تحوّل;تخذ;ترك;تسع;تسعة;تسعمئة;تسعمائة;تسعون;تسعين;تشرين;تعسا;تعلَّم;تفعلان;تفعلون;تفعلين;تكون;تلقاء;تلك;تم;تموز;تينك;تَيْنِ;تِه;تِي;ث;ثاء;ثالث;ثامن;ثان;ثاني;ثلاث;ثلاثاء;ثلاثة;ثلاثمئة;ثلاثمائة;ثلاثون;ثلاثين;ثم;ثمان;ثمانمئة;ثمانون;ثماني;ثمانية;ثمانين;ثمنمئة;ثمَّ;ثمّ;ثمّة;ج;جانفي;جدا;جعل;جلل;جمعة;جميع;جنيه;جوان;جويلية;جير;جيم;ح;حاء;حادي;حار;حاشا;حاليا;حاي;حبذا;حبيب;حتى;حجا;حدَث;حرى;حزيران;حسب;حقا;حمدا;حمو;حمٌ;حوالى;حول;حيث;حيثما;حين;حيَّ;حَذارِ;خ;خاء;خاصة;خال;خامس;خبَّر;خلا;خلافا;خلال;خلف;خمس;خمسة;خمسمئة;خمسمائة;خمسون;خمسين;خميس;د;دال;درهم;درى;دواليك;دولار;دون;دونك;ديسمبر;دينار;ذ;ذا;ذات;ذاك;ذال;ذانك;ذانِ;ذلك;ذهب;ذو;ذيت;ذينك;ذَيْنِ;ذِه;ذِي;ر;رأى;راء;رابع;راح;رجع;رزق;رويدك;ريال;ريث;رُبَّ;ز;زاي;زعم;زود;زيارة;س;ساء;سابع;سادس;سبت;سبتمبر;سبحان;سبع;سبعة;سبعمئة;سبعمائة;سبعون;سبعين;ست;ستة;ستكون;ستمئة;ستمائة;ستون;ستين;سحقا;سرا;سرعان;سقى;سمعا;سنة;سنتيم;سنوات;سوف;سوى;سين;ش;شباط;شبه;شتانَ;شخصا;شرع;شمال;شيكل;شين;شَتَّانَ;ص;صاد;صار;صباح;صبر;صبرا;صدقا;صراحة;صفر;صهٍ;صهْ;ض;ضاد;ضحوة;ضد;ضمن;ط;طاء;طاق;طالما;طرا;طفق;طَق;ظ;ظاء;ظل;ظلّ;ظنَّ;ع;عاد;عاشر;عام;عاما;عامة;عجبا;عدا;عدة;عدد;عدم;عدَّ;عسى;عشر;عشرة;عشرون;عشرين;عل;علق;علم;على;علي;عليك;عليه;عليها;علًّ;عن;عند;عندما;عنه;عنها;عوض;عيانا;عين;عَدَسْ;غ;غادر;غالبا;غدا;غداة;غير;غين;ـ;ف;فإن;فاء;فان;فانه;فبراير;فرادى;فضلا;فقد;فقط;فكان;فلان;فلس;فهو;فو;فوق;فى;في;فيفري;فيه;فيها;ق;قاطبة;قاف;قال;قام;قبل;قد;قرش;قطّ;قلما;قوة;ك;كأن;كأنّ;كأيّ;كأيّن;كاد;كاف;كان;كانت;كانون;كثيرا;كذا;كذلك;كرب;كسا;كل;كلتا;كلم;كلَّا;كلّما;كم;كما;كن;كى;كيت;كيف;كيفما;كِخ;ل;لأن;لا;لا سيما;لات;لازال;لاسيما;لام;لايزال;لبيك;لدن;لدى;لدي;لذلك;لعل;لعلَّ;لعمر;لقاء;لكن;لكنه;لكنَّ;للامم;لم;لما;لمّا;لن;له;لها;لهذا;لهم;لو;لوكالة;لولا;لوما;ليت;ليرة;ليس;ليسب;م;مئة;مئتان;ما;ما أفعله;ما انفك;ما برح;مائة;ماانفك;مابرح;مادام;ماذا;مارس;مازال;مافتئ;ماي;مايزال;مايو;متى;مثل;مذ;مرّة;مساء;مع;معاذ;معه;مقابل;مكانكم;مكانكما;مكانكنّ;مكانَك;مليار;مليم;مليون;مما;من;منذ;منه;منها;مه;مهما;ميم;ن;نا;نبَّا;نحن;نحو;نعم;نفس;نفسه;نهاية;نوفمبر;نون;نيسان;نيف;نَخْ;نَّ;ه;هؤلاء;ها;هاء;هاكَ;هبّ;هذا;هذه;هل;هللة;هلم;هلّا;هم;هما;همزة;هن;هنا;هناك;هنالك;هو;هي;هيا;هيهات;هيّا;هَؤلاء;هَاتانِ;هَاتَيْنِ;هَاتِه;هَاتِي;هَجْ;هَذا;هَذانِ;هَذَيْنِ;هَذِه;هَذِي;هَيْهات;و;و6;وأبو;وأن;وا;واحد;واضاف;واضافت;واكد;والتي;والذي;وان;واهاً;واو;واوضح;وبين;وثي;وجد;وراءَك;ورد;وعلى;وفي;وقال;وقالت;وقد;وقف;وكان;وكانت;ولا;ولايزال;ولكن;ولم;وله;وليس;ومع;ومن;وهب;وهذا;وهو;وهي;وَيْ;وُشْكَانَ;ى;ي;ياء;يفعلان;يفعلون;يكون;يلي;يمكن;يمين;ين;يناير;يوان;يورو;يوليو;يوم;يونيو;ّأيّان;عاجل;هام";


function remove_words($input,$unique_words = true)
{
	//separate all words based on spaces
	$input_array = explode(' ',$input);
	
	//$slug = explode (' ', $slug);
  $input_array=array_map('trim',$input_array);
  if($unique_words) $input_array=array_unique($input_array); 
 //echo self::$ArStopWords;
 $words_array=explode(';',self::$StopWords);//json_decode(self::$ArStopWords,true);
  //$swords=explode(' ',$stopWords);// json_decode($ArStopWords,true);
  return array_diff($input_array,$words_array);
  

 // return array_diff($input_array,$swords);
// return $input_array;
  //return implode ($replace, $input_array);	
}
public static function generateSeoURL($string, $wordLimit = 0){
    $separator = '-';
     $quoteSeparator = preg_quote($separator, '#');

    $trans = array(
        '&.+?;:!'                    => '',
        '[^\w\d _-]'            => '',
        '\s+'                    => ' ',
        '('.$quoteSeparator.')+'=> ' '
    );
	
	
    foreach ($trans as $key => $val){
        $string = preg_replace('#'.$key.'#i'.(UTF8_ENABLED ? 'u' : ''), $val, $string);
    }
	

    $string = strtolower($string);
	$wordArr=self::remove_words($string);

    if($wordLimit != 0)$wordArr=array_slice($wordArr, 0, $wordLimit);
       
 return  trim(implode ($separator, $wordArr),$separator);
  
}

}

?>